""""Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км.
Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один одному.
Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого автомобілями;
загальний шлях = час · сумарна швидкість"""
v1 = int(input("Введіть v1:"))

v2 = int(input("Введіть v2:"))

S = int(input("Введіть S:"))

t = int(input("Введіть t:"))

all_S = t * (v1-v2)

S_t = abs(S - all_S)

print(S_t)
print("  ")
